# Урок №16. Классы и объекты
# Задание №1
# Создайте класс Касса, который хранит текущее количество денег в кассе, у него есть методы:
# ●	top_up(X) - пополнить на X
# ●	count_1000() - выводит сколько целых тысяч осталось в кассе
# ●	take_away(X) - забрать X из кассы, либо выкинуть ошибку, что не достаточно денег

class Касса(object):
    money = 0

    def __init__(self, m):
        self.money = m
    # def __init__(self, money):
    #     self.money = money
    
    # def top_up(self):
    #     print(f"Введите, сколько денег положить в кассу?")
    #     Касса.money += int(input())
        
    def top_up(self, X):        
        self.money += X
        print(f"В кассу добавлено {X} долларов")

    def count_1000(self):
        #TODO вставить окончания "тысяч", "тысячи", "тысяча" в зависимости от числа
        # print(f"self.money={self.money}")
        # k = self.money // 1000
        # print(f"k={k}") 
        if (self.money // 1000) < 1:
            print(f"в кассе меньше тысячи долларов")
            return
        print(f"в кассе {self.money // 1000} тысяч долларов")

    def take_away(self, X):
        if self.money < X:
            return print(f"Недостаточно средств в кассе, вы хотели взять {X} долларов, а в кассе всего {self.money} долларов")
        self.money -= X
        print(f"Из кассы взято {X} долларов")
    
    def status(self):
        print(f"в кассе {self.money} долларов")





cash = Касса(50)
cash.status()
cash.top_up(949)
cash.status()
cash.count_1000()
cash.top_up(35000)
cash.status()
cash.count_1000()
cash.status()
cash.take_away(15949)
cash.status()
cash.take_away(55949)
cash.status()





# #=====================================================================================================================================
# #функция menu
# #=====================================================================================================================================
# def menu():
    
#     print("")
#     print("==========Menu=========")
#     print(f"на данный момент в кассе {cash.money} долларов")
#     print("Введите команду:")
#     print("\033[33mtest - будет сгенерирова база рандомными записями для теста (максимум 30 записей):) \033[0m\033[1;31m[для тестов]\033[0m")
#     print("put_money - положить деньги в кассу")
#     print("take_money - забрать деньги из кассы")
#     print("\033[33mstatus - вывести информацию, сколько денег находится в кассе\033[0m\033[1;31m[для тестов]\033[0m")
#     print("1k - вывести информацию, сколько тысяч долларов находится в кассе")
#     print("stop - завершить работу программы")

#     command = input()
#     return command

# #=====================================================================================================================================
# #основная программа
# #=====================================================================================================================================

# while True:
#     command = menu()
#     if command.lower() == "stop":
#         print("\033[H\033[J", end="")
#         print("stop")
#         print(f"Команда \"stop\" получена. Завершение программы.")
#         break
#     elif command.lower() == "put_money":
#         print("\033[H\033[J", end="")
#         print("put_money")
#         print("Введите, сколько денег положить в кассу:")
#         #TODO проверка на число
#         Касса.top_up(int(input()))
#     elif command.lower() == "take_money":
#         print("\033[H\033[J", end="")
#         print("take_money")
#         print("Введите, сколько денег забрать из кассы:")
#         Касса.take_away(int(input()))
#     elif command.lower() == "1k":
#         print("\033[H\033[J", end="")
#         print("1k")
#         print("")
#         Касса.count_1000()
#     elif command.lower() == "status":
#         print("\033[H\033[J", end="")
#         print("status")
#         print("")
#         Касса.status()
#     else:
#         print("")
#         print(f"Такой команды не существует, повторите ввод")