#большой список эмодзи можно посмотреть https://github.com/wooorm/gemoji/blob/main/support.md
class Emoji(object):
    CELL_TYPES = {
        0: "🟩", #пустое поле
        1: "🏞️ ", #горный заповедник
        2: "🗻", #гора
        3: "🌋", #красня гора

        4: "⛳ ", #поле для гольфа⛳

        5: "🌲", #дерево1
        6: "🌳", #дерево2
        7: "🎄", #дерево3
        8: "🌴", #дерево4

        9: "🌊",

        10: "🏥", # 10: "🏩",
        11: "🛕",

        12: "🔥",
        13: "☁️ ",
        14: "🌧️ ",
        15: "⛈️ ",

        16: "🚁",

        17: "💧",
        18: "💎",
        19: "❤️",
        
        20: "🚧",
        21: "🟫"
    }

FIELD_GRASS = 0
MOUNTAIN1 = 1 #горный заповедник
MOUNTAIN2 = 2 #гора
MOUNTAIN3 = 3 #красня гора
GOLF_FIELD = 4
PINE = 5 #сосна
TREE = 6 #дерево
CHRISTMAS_TREE = 7 #ёлка [новогодняя]
PALM = 8 #пальма
RIVER = 9 #река
HOSPITAL = 10 #больница
GARAGE = 11 #магазин улучшений, гараж
FIELD_FIRE = 12 #пожар
CLOUD = 13 #облака
CLOUD_RAIN = 14 #дождевые облака
CLOUD_LIGHTING = 15 #грозовые облака
HELICOPTER = 16 #вертолёт
WATER_SCORE = 17 #капля воды [количество воды в баке вертолёта]
DIAMOND_SCORE = 18 #бриллиант [количество очков]
LIFE_HEART = 19 #сердечко [количество жизней]
UNDER_CONSTRACTION = 20 #ограничитель поля
CONFLAGRATION = 21 #пожарище [земля после непотушенного пожара]

MOUNTAIN_START = MOUNTAIN1
MOUNTAIN_END = MOUNTAIN3
TREE_START = PINE
TREE_END = PALM
CLOUD_START = CLOUD
CLOUD_END = CLOUD_LIGHTING

#для слоя облаков и поведения вертолёта
CLOUD_FIELD = 1
CLOUD_RAIN_FIELD = 2
CLOUD_LIGHTING_FIELD = 3

# можно использовать для улучшений
# 🟥🟧🟨🟩🟦🟪🟫⬛⬜🔲
# ❤️🧡💛💚💙💜🤎🖤🤍♥️
# 🌲🌳🌴🎄
# 🏔️⛰️🌋🗻
# 🏟️🏛️🏘️🏚️🏠🏡🏢🏣🏤🏥🏦🏨🏩🏪🏫🏬🏭🏯🏰💒⛪🕌🛕🕍
# 🚁🛸
# ☁️⛅🌥️⚡️
# 🌨️🌧️🌦️🌩️⛈️🌤️
# 🌪️🔥💧🌊
# 🏆🏅🥇🥈🥉💎⭐🌟
# 🛠️🔧🛡️📡💊🧺
# ☢️☣️💣🧊
# 🗺️🧭
# ⌚⏰⏱️⏲️🕰️🕛🕧🕐🕜🕑🕝🕒🕞🕓🕟🕔🕠🕕🕡🕖🕢🕗🕣🕘🕤🕙🕥🕚🕦
# ⌛⏳
# 🛌💤💥💀☠️
# 😨😰😥😢😭😱😎😉
# 🚧
